<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="image" type="Parameter" version="opset1">
			<data shape="?,3,864,864" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="image">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>864</dim>
					<dim>864</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="/Constant_24" type="Const" version="opset1">
			<data element_type="f32" shape="1, 4, 4" offset="0" size="64" />
			<output>
				<port id="0" precision="FP32" names="/Constant_24_output_0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_11_output_0" />
			</output>
		</layer>
		<layer id="3" name="Constant_22296" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="72" size="12" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Multiply_22298" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>864</dim>
					<dim>864</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>864</dim>
					<dim>864</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_22300" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="84" size="12" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Divide_10534" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>864</dim>
					<dim>864</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>864</dim>
					<dim>864</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="onnx::Conv_1048" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="96" size="3456" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1048">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/backbone/init_block/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>864</dim>
					<dim>864</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Reshape_142" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3552" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/backbone/init_block/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/init_block/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/backbone/init_block/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/init_block/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="onnx::Conv_1051" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 1, 1" offset="3680" size="4096" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1051">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/backbone/stage1/unit1/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_161" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="7776" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/backbone/stage1/unit1/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/unit1/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/backbone/stage1/unit1/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage1/unit1/conv1/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Reshape_176" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="7904" size="1152" />
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/backbone/stage1/unit1/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Reshape_228" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="9056" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/backbone/stage1/unit1/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/unit1/conv2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/backbone/stage1/unit1/conv2/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage1/unit1/conv2/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="onnx::Conv_1057" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 1, 1" offset="9184" size="2048" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1057">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/backbone/stage1/unit1/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Reshape_247" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="11232" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/backbone/stage1/unit1/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/unit1/conv3/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="onnx::Conv_1060" type="Const" version="opset1">
			<data element_type="f32" shape="96, 16, 1, 1" offset="11296" size="6144" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1060">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/backbone/stage2/unit1/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Reshape_262" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="17440" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/backbone/stage2/unit1/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit1/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/backbone/stage2/unit1/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/unit1/conv1/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Reshape_277" type="Const" version="opset1">
			<data element_type="f32" shape="96, 1, 1, 3, 3" offset="17824" size="3456" />
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/backbone/stage2/unit1/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Reshape_329" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="21280" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/backbone/stage2/unit1/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit1/conv2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/backbone/stage2/unit1/conv2/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/unit1/conv2/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="onnx::Conv_1066" type="Const" version="opset1">
			<data element_type="f32" shape="24, 96, 1, 1" offset="21664" size="9216" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1066">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/backbone/stage2/unit1/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Reshape_348" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="30880" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/backbone/stage2/unit1/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit1/conv3/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="onnx::Conv_1069" type="Const" version="opset1">
			<data element_type="f32" shape="144, 24, 1, 1" offset="30976" size="13824" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1069">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/backbone/stage2/unit2/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Reshape_363" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="44800" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/backbone/stage2/unit2/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit2/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/backbone/stage2/unit2/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/unit2/conv1/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Reshape_378" type="Const" version="opset1">
			<data element_type="f32" shape="144, 1, 1, 3, 3" offset="45376" size="5184" />
			<output>
				<port id="0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/backbone/stage2/unit2/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Reshape_430" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="50560" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/backbone/stage2/unit2/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit2/conv2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/backbone/stage2/unit2/conv2/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/unit2/conv2/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="onnx::Conv_1075" type="Const" version="opset1">
			<data element_type="f32" shape="24, 144, 1, 1" offset="51136" size="13824" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1075">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/backbone/stage2/unit2/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Reshape_449" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="64960" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/backbone/stage2/unit2/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit2/conv3/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/backbone/stage2/unit2/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/unit2/Add_output_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="onnx::Conv_1078" type="Const" version="opset1">
			<data element_type="f32" shape="144, 24, 1, 1" offset="65056" size="13824" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1078">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/backbone/stage3/unit1/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Reshape_465" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="78880" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/backbone/stage3/unit1/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit1/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/backbone/stage3/unit1/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage3/unit1/conv1/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Reshape_480" type="Const" version="opset1">
			<data element_type="f32" shape="144, 1, 1, 3, 3" offset="79456" size="5184" />
			<output>
				<port id="0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/backbone/stage3/unit1/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Reshape_532" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="84640" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/backbone/stage3/unit1/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit1/conv2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/backbone/stage3/unit1/conv2/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage3/unit1/conv2/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="onnx::Conv_1084" type="Const" version="opset1">
			<data element_type="f32" shape="32, 144, 1, 1" offset="85216" size="18432" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1084">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/backbone/stage3/unit1/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Reshape_551" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="103648" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/backbone/stage3/unit1/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit1/conv3/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="onnx::Conv_1087" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="103776" size="24576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1087">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/backbone/stage3/unit2/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Reshape_566" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="128352" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/backbone/stage3/unit2/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit2/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/backbone/stage3/unit2/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage3/unit2/conv1/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Reshape_581" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="129120" size="6912" />
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/backbone/stage3/unit2/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Reshape_633" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="136032" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/backbone/stage3/unit2/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit2/conv2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/backbone/stage3/unit2/conv2/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage3/unit2/conv2/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="onnx::Conv_1093" type="Const" version="opset1">
			<data element_type="f32" shape="32, 192, 1, 1" offset="136800" size="24576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1093">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/backbone/stage3/unit2/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Reshape_652" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="161376" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/backbone/stage3/unit2/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit2/conv3/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/backbone/stage3/unit2/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit2/Add_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="onnx::Conv_1096" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="161504" size="24576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1096">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/backbone/stage3/unit3/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Reshape_668" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="186080" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/backbone/stage3/unit3/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit3/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/backbone/stage3/unit3/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage3/unit3/conv1/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Reshape_683" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="186848" size="6912" />
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/backbone/stage3/unit3/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Reshape_735" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="193760" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/backbone/stage3/unit3/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit3/conv2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/backbone/stage3/unit3/conv2/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage3/unit3/conv2/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="onnx::Conv_1102" type="Const" version="opset1">
			<data element_type="f32" shape="32, 192, 1, 1" offset="194528" size="24576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1102">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/backbone/stage3/unit3/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Reshape_754" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="219104" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/backbone/stage3/unit3/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit3/conv3/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/backbone/stage3/unit3/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage3/unit3/Add_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="onnx::Conv_1105" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="219232" size="24576" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1105">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/backbone/stage4/unit1/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Reshape_770" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="243808" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/backbone/stage4/unit1/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage4/unit1/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/backbone/stage4/unit1/conv1/activ/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage4/unit1/conv1/activ/Clip_output_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Reshape_785" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="244576" size="6912" />
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/backbone/stage4/unit1/conv2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
